RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
              case 2:
              { 
                uint32_t showInsertCounter = insertCounterAnalogTable % 50;               
                double theRead = ((double)showInsertCounter) / 10;
                return theRead;
              }
              break;
              case 0:
              case 1:
              {
                return roundf((float)25.0 * (float)sin(PI / 2.0 + (secondsOnDayElapsed * ((frequDeterminer * PI) / (float)86400)))) / 10  + y_offset;          
              }
              break;
              default:
              {
                return 0;
              }
            }
  #endif
}
void createSampleTime(DateTime dateTimeUTCNow, int timeZoneOffsetUTC, char * sampleTime)
{
  int hoursOffset = timeZoneOffsetUTC / 60;
  int minutesOffset = timeZoneOffsetUTC % 60;
  char sign = timeZoneOffsetUTC < 0 ? '-' : '+';
  char TimeOffsetUTCString[10];
  sprintf(TimeOffsetUTCString, " %c%03i", sign, timeZoneOffsetUTC);
  TimeSpan timespanOffsetToUTC = TimeSpan(0, hoursOffset, minutesOffset, 0);
  DateTime newDateTime = dateTimeUTCNow + timespanOffsetToUTC;
  sprintf(sampleTime, "%02i/%02i/%04i %02i:%02i:%02i%s",newDateTime.month(), newDateTime.day(), newDateTime.year(), newDateTime.hour(), newDateTime.minute(), newDateTime.second(), TimeOffsetUTCString);
}
 
void makeRowKey(DateTime actDate,  az_span outSpan, size_t *outSpanLength)
{
  // formatting the RowKey (= reverseDate) this way to have the tables sorted with last added row upmost
  char rowKeyBuf[20] {0};

  sprintf(rowKeyBuf, "%4i%02i%02i%02i%02i%02i", (10000 - actDate.year()), (12 - actDate.month()), (31 - actDate.day()), (23 - actDate.hour()), (59 - actDate.minute()), (59 - actDate.second()));
  az_span retValue = az_span_create_from_str((char *)rowKeyBuf);
  az_span_copy(outSpan, retValue);
  *outSpanLength = retValue._internal.size;         
}

void makePartitionKey(const char * partitionKeyprefix, bool augmentWithYear, DateTime dateTime, az_span outSpan, size_t *outSpanLength)
{
  // if wanted, augment with year and month (12 - month for right order)                    
  char dateBuf[20] {0};
  sprintf(dateBuf, "%s%d-%02d", partitionKeyprefix, (dateTime.year()), (12 - dateTime.month()));                  
  az_span ret_1 = az_span_create_from_str((char *)dateBuf);
  az_span ret_2 = az_span_create_from_str((char *)partitionKeyprefix);                       
  if (augmentWithYear == true)
  {
    az_span_copy(outSpan, ret_1);            
    *outSpanLength = ret_1._internal.size; 
  }
    else
  {
    az_span_copy(outSpan, ret_2);
    *outSpanLength = ret_2._internal.size;
  }    
}

bool extractSubString (const char * source, const String startTag, const String endTag, char * result, const int maxResultLength)
{
  char * start = strstr(source, startTag.c_str());
  if (start)
  {
    start += startTag.length();
    const char * end = strstr(start, endTag.c_str());
    if (end)
    {
      size_t length = end - start < maxResultLength - 1 ? end - start : maxResultLength - 1;
      strncpy(result, start, length);
      result[length] = '\0';      
      return true;
    }
    else
    {
      result[0] = '\0';
      return false;
    }
  }
  else
  {
     result[0] = '\0';
     return false;
  }
}

t_httpCode readFeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, const uint32_t data_0_id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr)
{  
   #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

  #if VIESSMANN_TRANSPORT_PROTOCOL == 1 
    wifi_client.setCACert(myX509Certificate);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  memset(bufferStorePtr, '\0', bufferStoreLength);
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
  Serial.printf("\r\n(%u) ",loadFeaturesCount);
  Serial.printf("%i/%02d/%02d %02d:%02d ", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
  t_httpCode responseCode = viessmannClient.GetFeatures(bufferStorePtr, bufferStoreLength, data_0_id, Gateways_0_Serial, Gateways_0_Devices_0_Id, apiSelectionPtr);
  Serial.printf("(%u) Features: httpResponseCode is: %d\r\n", loadFeaturesCount++, responseCode);
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    // Populate features array and replace the name read from Api
    // with the name used in this Application
    features[0] = apiSelectionPtr ->_3_temperature_main;
    strcpy(features[0].name, (const char *)"_3_temperature_main");
    features[1] = apiSelectionPtr ->_5_boiler_temperature;
    strcpy(features[1].name, (const char *)"_5_boiler_temperature");
    features[2] = apiSelectionPtr ->_7_burner_modulation;
    strcpy(features[2].name, (const char *)"_7_burner_modulation");
    features[3] = apiSelectionPtr ->_8_burner_hours;
    strcpy(features[3].name, (const char *)"_8_burner_hours");
    features[4] = apiSelectionPtr ->_8_burner_starts;
    strcpy(features[4].name, (const char *)"_8_burner_starts");
    features[5] = apiSelectionPtr ->_9_burner_is_active;
    strcpy(features[5].name, (const char *)"_9_burner_is_active");
    features[6] = apiSelectionPtr ->_23_heating_curve_shift;
    strcpy(features[6].name, (const char *)"_23_heating_curve_shift");
    features[7] = apiSelectionPtr ->_23_heating_curve_slope;
    strcpy(features[7].name, (const char *)"_23_heating_curve_slope");
    features[8] = apiSelectionPtr ->_77_temperature_supply;
    strcpy(features[8].name, (const char *)"_77_temperature_supply");
    features[9] = apiSelectionPtr ->_85_heating_dhw_charging;
    strcpy(features[9].name, (const char *)"_85_heating_dhw_charging");
    features[10] = apiSelectionPtr ->_86_heating_dhw_pump_status;
    strcpy(features[10].name, (const char *)"_86_heating_dhw_pump_status");
    features[11] = apiSelectionPtr ->_88_heating_dhw_pump_primary_status;
    strcpy(features[11].name, (const char *)"_88_heating_dhw_pump_primary_status");
    features[12] = apiSelectionPtr ->_90_heating_dhw_cylinder_temperature;
    strcpy(features[12].name, (const char *)"_90_heating_dhw_cylinder_temperature");
    features[13] = apiSelectionPtr ->_92_heating_dhw_outlet_temperature;
    strcpy(features[13].name, (const char *)"_92_heating_dhw_outlet_temperature");
    features[14] = apiSelectionPtr ->_93_heating_dhw_main_temperature;
    strcpy(features[14].name, (const char *)"_93_heating_dhw_main_temperature");
    features[15] = apiSelectionPtr ->_95_heating_temperature_outside;
    strcpy(features[15].name, (const char *)"_95_heating_temperature_outside");
    
